
## Terraform plan for environment: `prep`

**Commit:** 95cb7f08a1814e1a01f2e1454f92336a5b93638e


**API version:** release-v6.3.0
**CLI version:** release-v6.3.0
**Selfserve version:** release-v6.3.0
**Internal version:** release-v6.3.0

### Plan summary

`1 to add, 5 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_listener_rule.this["pdf-converter"]
```
**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_lb_listener_rule.this["pdf-converter"] will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/72b340b1c43c2500"
      + priority     = 86
      + tags_all     = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/vol-app-prep-pdf-converter-tg/3e4867cd8e4a9ec5"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "renderer.*",
                ]
            }
        }
      + condition {
          + source_ip {
              + values = [
                  + "10.174.144.64/28",
                  + "10.174.144.80/28",
                  + "10.174.144.96/28",
                ]
            }
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:70" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.3.0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:70"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 70 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:70" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.3.0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:70"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 70 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:70" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.3.0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:70"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 70 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:70" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.3.0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:70"
        name                       = "vol-app-prep-sas-mi-extract"
      ~ revision                   = 70 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:6",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:63",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::146997448015:policy/vol-app-prep-batch-scheduler-inline"
        name             = "vol-app-prep-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:70",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:70",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:70",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:70",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:6",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:63",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:63",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-prep-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

```

</details>